       IDENTIFICATION DIVISION.
       PROGRAM-ID. KALKULATOR.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 ANGKA1        PIC 9(9).
       01 ANGKA2        PIC 9(9).
       01 HASIL         PIC 9(10).
       01 ANGKA1-TAMPIL PIC Z(9)9.
       01 ANGKA2-TAMPIL PIC Z(9)9.
       01 HASIL-TAMPIL  PIC Z(10)9.
       PROCEDURE DIVISION.
       MAIN.
       DISPLAY "MASUKKAN ANGKA 1: ".
       ACCEPT ANGKA1.
       DISPLAY "MASUKKAN ANGKA 2: ".
       ACCEPT ANGKA2.

       COMPUTE HASIL = ANGKA1 + ANGKA2.
       MOVE ANGKA1 TO ANGKA1-TAMPIL
       MOVE ANGKA2 TO ANGKA2-TAMPIL
       MOVE HASIL  TO HASIL-TAMPIL

       DISPLAY "HASIL: "
            FUNCTION TRIM(ANGKA1-TAMPIL) " + "
            FUNCTION TRIM(ANGKA2-TAMPIL) " = "
            FUNCTION TRIM(HASIL-TAMPIL).

       STOP RUN.
